# FailedWhenLoadingFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FailedWhenLoadingFamily Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Some unlocked labeled dimensions prevent family from loading. Please try to lock unlocked labeled dimensions and load again.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedWhenLoadingFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedWhenLoadingFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedWhenLoadingFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace